[
  {
    "headline": "YZY × ГОША РУБЧИНСКИЙ",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a2ba4172bd96c7a27f1f3_IMG_4286%201.jpg",
    "image_name": "Blake, Wm. The Great Red Dragon and the Woman Clothed in Sun. 1806-1809.",
    "description": "LOS ANGELES, CA.—YEEZY welcomes Gosha Rubchinskiy as its new Head of Design today. The arrival of this legendary Russian designer at YEEZY, the pre-eminent global brand in music and fashion, is a milestone in design history.",
    "source": "https://yeezy.com"
  },
  {
    "headline": "Elon Plans New University in Austin",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a0eb383af02b09092a233_Blake%2C%20Wm.%20Age%20Teaching%20Youth.%201785..jpg",
    "image_name": "Blake, Wm. Age Teaching Youth. 1785.",
    "description": "Elon Musk is planning to start a university in Austin, Texas, according to tax filings from his charity The Foundation.\n‍\nSeeded with $100 million from Musk, the new institution will begin with a STEM-focused primary and secondary school that has an initial class of 50 students.\n‍\nThe ultimate goal is expanding operations “to create a university dedicated to education at the highest levels.”\n‍\nThe university will employ “experienced faculty” and feature a “hands-on learning experience including simulations, case studies, fabrication/design projects and labs.”\n‍\nThe timing of this news is notable—it comes as top schools like Harvard and UPenn are battling accusations of antisemitism and declining educational standards that many say have harmed their world-renowned reputation.\n‍\nThe question has always been if a new, top-notch university can emerge, and time will tell if Musk delivers.",
    "source": "https://archive.is/KJWmW"
  },
  {
    "headline": "Southwest Airlines Rewards Obesity",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a2099855fc5284a21793c_Blake%2C%20Wm.%20Frontispiece%20to%20The%20Elephant%2C%20Ballad%20the%20First.%201802..jpg",
    "image_name": "Blake, Wm. Frontispiece to The Elephant, Ballad the First. 1802.",
    "description": "Southwest Airlines' “customer of size” policy offers complimentary extra seats for fat passengers, garnering praise from overweight influencers.\n        Passengers can request an additional seat or 2 at no extra cost if their body extends beyond the armrest, even for fully booked flights.\n        Overweight customers are the top priority, as there is one public case where 3 passengers were removed from an “overbooked flight” to accommodate a \"customer of size,\" despite spending $620.72 on tickets.\n        Critic: “Please help me understand. Why do I have to spend the night without any accommodations in Baltimore because an oversized person didn’t purchase a second ticket?”\n        Jae’lynn Chaney, Plus-Sized Travel Expert: “Super fat is how we identify. There’s a spectrum of fatness. And as a ‘super fat’ individual you start needing different accommodations. The Southwest customer size policy helps many travelers offset the disproportionate costs that we incur because of needing extra room.”",
    "source": "https://nypost.com/2023/12/13/news/southwest-airlines-is-praised-for-customers-of-size-policy/amp/"
  },
  {
    "headline": "Google, Apple Lose Grip on App Stores",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a0f4ecd1c93c274f4d98f_Blake%2C%20Wm.%20The%20Progress%20of%20Poesy.%201797..jpg",
    "image_name": "Blake, Wm. The Progress of Poesy. 1797.",
    "description": "A federal jury in San Francisco on Monday found that Google’s app store was an illegal monopoly that the company used to prevent competition.\n        This comes just months after Google settled with a coalition of state attorneys general, who also alleged Google’s store was breaking antitrust laws.\n        In South Korea and the Netherlands, legal challenges have been mounted against the 30% fees that Google and Apple charge on app store transactions.\n        Apple and Google make billions of dollars a year funneling users to make purchases through their app stores, and these legal challenges could threaten their dominance for the first time.",
    "source": "https://www.msn.com/en-us/news/technology/google-and-apple-s-iron-grip-on-app-stores-is-slipping/ar-AA1lrkFY"
  },
  {
    "headline": "Poll: Majority of Couples Meet Online",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a0f9f5c2c914e85ff1994_Blake%2C%20Wm.%20The%20Angel%20of%20the%20Divine%20Presence%20Clothing%20Adam%20and%20Eve%20with%20Coats%20of%20Skins.%201780..jpg",
    "image_name": "Blake, Wm. The Angel of the Divine Presence Clothing Adam and Eve with Coats of Skins. 1780.",
    "description": "A graph depicting how couples met in the U.S. from 1950 to 2020 has gone viral on social media, shocking users with the changes over the years.\n        In 2020, less than 10% of American couples met through friends, compared to nearly 30% in 2010.\n        This decline corresponded with a rapid increase in U.S. couples meeting online, with over 50% in 2020, doubling from 2010.\n        Other ways couples meet, such as work, bars, school, neighbors, and college, have all declined as well, sinking all below 10%.\n        One user captioned the graph: “This is catastrophic.”\n        In 2023, 70% of couples met through online dating, according to Forbes.\n        This all comes as 45% of men aged 18 to 25 say they have never approached a woman in person.",
    "source": "https://twitter.com/ichthys30/status/1734953685451460712"
  },
  {
    "headline": "Sneakerheads Stunned by Ross Prices",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a13a42f18aef113ce817d_Blake%2C%20Wm.%20Enoch%20Walked%20with%20God.%201780..jpg",
    "image_name": "Blake, Wm. Enoch Walked with God. 1780.",
    "description": "Social media users are shocked that “White Cement Reimagined” Air Jordan 3s are selling for just $85 at Ross.\n        The sneaker was released in March for $210, and multiple users on X have posted pictures from Ross showing the discounted price tag, seemingly in disbelief.\n        A user said the store told him only a limited number of pairs were available, including in sizes 11, 12, and 17.\n        One user: “MAN ROSS HAS BEEN GETTING ONE OF THE BEST AIR JORDANS OF 2023! AIR JORDAN 3 REIMAGINED HAVE BEEN POPPING UP AT MULTIPLE ROSS LOCATIONS.”",
    "source": "https://www.complex.com/sneakers/a/victor-deng/air-jordan-3-white-cement-reimagined-ross-stores"
  },
  {
    "headline": "DeSantis Surrogate Embarrassed on TV",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a0fb7262ca162f45dbc45_Blake%2C%20Wm.%20The%20First%20Book%20of%20Urizen%2C%20object%203.%201794..jpg",
    "image_name": "Blake, Wm. The First Book of Urizen, object 3. 1794.",
    "description": "Dave Rubin, a washed-up podcaster who purchased both his children earlier this year, appeared on Bill Maher’s show, where he was grilled for his support for DeSantis as president.\n        Maher asked Rubin: “I assume if [Trump] is the nominee, we’ll vote for this.”\n        Rubin ignored the question, responding, “I want Ron DeSantis to be president—,” with Maher interrupting, “I know, but it’s going to be Trump.”\n        Rubin: “We don’t know.”\n        Maher: “So he’s going to make up 41 points?”\n        Rubin: “Well 41 points, I mean I look at these polls, I mean they’re like—”\n        Maher: “Okay, who’s lying now? You think DeSantis is going to beat Trump for the nomination?”\n        Many speculate Rubin is being paid by the DeSantis campaign, simply for the reason that no reasonable person would willingly support a man who wears heels to look taller.",
    "source": "https://twitter.com/_johnnymaga/status/1734756068369023432"
  },
  {
    "headline": "Man Tries to Interview Tourettes Girl",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a10075d1358c3d6881a99_Blake%2C%20Wm.%20Whilst%20Surfeited%20Upon%20Thy%20Damask%20Cheek.%201805..jpg",
    "image_name": "Blake, Wm. Whilst Surfeited Upon Thy Damask Cheek. 1805.",
    "description": "Chris Cuomo interviewed a famous TikToker who has Tourette’s, and he couldn’t control his laughter as the girl told him: “Go fuck yourself, Chris ass bunny, old biscuit fat ass.”\n        Bayen Dupree has over nine million followers on TikTok, where she uses her platform to educate people about Tourette’s.\n        Cuomo brought her on as a guest, asking her at the start of the interview, “What do you hope you can do by taking the risks that you take?”\n        Throughout the interview, Dupree had various bursts of expletives, so much so that Cuomo began laughing less than two minutes in. \n        “I obviously go to the gym and I wear headphones and that's also a very big factor in how... fuck off. Fuck Collin, fuck that bitch,” she said later on.\n        Cumo showed her sincere gratitude at the end: “I gotta go to phone calls because they’re blowing up with support for you. Bayen Dupree, thank you for what you’re doing.”",
    "source": "https://twitter.com/collinrugg/status/1734936664408244553?s=46&t=lV1JRlKkePuCJV_o12ezeg"
  },
  {
    "headline": "Polish Lawmaker Extinguishes Menorah",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a1149b02df358ac276814_Blake%2C%20Wm.%20For%20The%20Sexes%2C%20The%20Gates%20Of%20Paradise%20object%209.%201793..jpg",
    "image_name": "Blake, Wm. For The Sexes, The Gates Of Paradise object 9. 1793.",
    "description": "A member of parliament in Poland went viral yesterday for extinguishing a lit menorah in the country’s legislative building, and he has since explained his actions in a speech.\n        Speaking to other members of parliament, Grzegorz Braun said he is “restoring normalcy and balance, putting an end to acts of Satanic, Talmudic and racist triumphalism.”\n        He emphasized that “there can be no place for acts of racist, tribal, wild, Talmudic cults.”\n        The parliament’s chairman then told the Honorable Braun that he had “seriously disturbed the peace or order,” and that if he insults “followers of other religions” again, he will be excluded from proceedings.\n        Poland’s newly-elected prime minister Donald Tusk said it “can never happen again.”",
    "source": "https://www.cbsnews.com/news/poland-grzegorz-braun-menorah-candle-poland-parliament-fire-extinguisher/"
  },
  {
    "headline": "Students Design Homes to Revive City",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a1045a70db4dbb7097344_Blake%2C%20Wm.%20Saint%20Peter%20and%20Saint%20James%20with%20Dante%20and%20Beatrice%20and%20with%20Saint%20John%20Also.%201824..jpg",
    "image_name": "Blake, Wm. Saint Peter and Saint James with Dante and Beatrice and with Saint John Also. 1824.",
    "description": "Architecture students at Penn State are using 3D printing to revitalize a city that has been in decline.\n        Oil City, Pennsylvania, is where innovations in petroleum began in the 1800s, turning the city into a bustling economic nexus.\n        Today, however, the oil companies that supported the town’s economy and infrastructure in its early days have moved away, leaving the town in a gradual state of decline.\n        Selina Pedi-Smith, a community developer in the region: “The smaller towns have been in steady decline since then.”\n        In a mission to revitalize the city, Pedi-Smith reached out to the architecture school at Penn State.\n        One of Penn State’s initiatives right now is to use concrete to 3D print sustainable, affordable housing, and Pedi-Smith saw that technology as the perfect approach to reviving Oil City.\n        The school identified a plot of land in the city to be used as a case study in a class for how 3D-printed concrete homes could bolster the economy.\n        Students were divided into groups, with each creating different designs, all focusing on community engagement and tourism.\n        They presented their final designs to a jury of reviewers in December, and Pedi-Smith said she will take inspiration from each project as she continues her efforts to restore the city.\n        Trevor Klatt, student: “Resilient housing is very important, especially in a housing crisis that is continuously getting worse. We always need more houses.”",
    "source": "https://www.psu.edu/news/arts-and-architecture/story/architecture-students-focus-concrete-3d-printing-help-revitalize-oil/"
  }
]
