[
  {
    "headline": "College Democrats Break With Biden",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a784e7544bcb76197ab85_IMG_0156%201.jpg",
    "image_name": "Blake, Wm. America a Prophecy, object 12. 1795.",
    "description": 
      "The College Democrats of America, the official student arm of the Democratic Party, has called for a ceasefire in the Middle East, a request Biden has routinely denied to support.    In a press release today, the student organization says: “The College Democrats of America firmly believe that all human life is precious, and the targeting of civilians is a violation of international humanitarian law. Hence, we strongly condemn the violence that has claimed the lives of 16,500+ Palestinians and 1,200+ Israelis, including Americans, and wounded thousands more since October 7, 2023.”  The group then listed a series of demands, including the release of all hostages from Hamas, an immediate and lasting ceasefire, and the International Criminal Court holding perpetrators of atrocities accountable.  Biden has consistently refused to call for a ceasefire, despite even members of his own party and White House staff pleading with him to do so. That’s come at a cost—a Pew Research Center survey from last week found 80% of voters under the age of 30 disapprove of his handling of the conflict.",
    "source": "https://twitter.com/CollegeDems/status/1735021194032677110"
  },
  {
    "headline": "Computer Will Simulate Human Brain",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a70cffe62ca110a288e4d_Blake%2C%20Wm.%20Christ%20in%20the%20sepulchre%2C%20guarded%20by%20angels%27.%20Great%20Britain.%201808..jpg",
    "image_name": "Blake, WM. Christ in the Sepulchre, Guarded by Angels’. Great Britain. 1808.",
    "description": 
      "Australian researchers are working with Intel and Dell to engineer a giant supercomputer that can simulate the human brain.The computer, called DeepSouth, will be capable of emulating networks of spiking neurons at a whopping 228 trillion synaptic operations per second, matching the estimated rate at which the human brain completes operations.This means scientists could receive an unparalleled idea of how the human brain operates, providing answers to century-long mysteries.Expected to be operational in April of next year, DeepSouth’s revelations into the human brain would aid researchers in engineering AI that match the human brain’s intelligence and operations.Ralph Etienne-Cummings, computer engineering professor: “At the end of the day there’s two types of researchers who will be interested in this — either those studying neuroscience or those who want to prototype new engineering solutions in the AI space.”"
    ,
    "source": "https://futurism.com/the-byte/scientists-computer-neural-human-brain"
  },
  {
    "headline": "Twitch Now Allows ‘Artistic’ Nudity",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a705874ca6f8a346fa954_Blake%2C%20Wm.%20Eve%20Tempted%20by%20the%20Serpent.%201799..jpg",
    "image_name": "Blake, Wm. Eve Tempted by the Serpent. 1799.",
    "description": "Twitch, once a platform to make money from live-streaming games, is now appeasing its growing female user base by allowing for “artistic” nudity.  Specifically, content that “deliberately highlights breasts, buttocks or pelvic region,” is now allowed.   That’s not all—certain dances like “twerking, grinding, and pole dancing” are approved now.  Critics say Twitch is collapsing into a full-fledged porn site, questioning what incentives, if any, men have to become painstakingly good at a game if women can just show their tits and make bank."  ,
    "source": "https://www.dexerto.com/entertainment/twitch-updates-sexual-content-guidelines-amid-topless-meta-backlash-2430357/"
  },
  {
    "headline": "Australia Bans Engineered Stone",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a704417a34088f832743d_Blake%2C%20Wm.%20Joseph%20of%20Arimathea%20Preaching.%201794..jpg",
    "image_name": "Blake, Wm. Joseph of Arimathea Preaching. 1794.",
    "description":       "Australia has become the first country to ban engineered stone, a material largely used for kitchen benches and bathrooms. Effective July 2024, The decision follows a significant rise in silicosis cases among hundreds of workers handling the material largely used for kitchen benches and bathrooms.Dr. Ryan Hoy, respiratory physician: “Some of these people with silicosis, they're extremely sick... we have a condition which caused them to become so short of breath it's hard to do just normal daily activities. We really need to change the ways to identify problems at work, and act before people become sick.”Liam O'Brien, assistant secretary of the Council of Trade Unions: \"Engineered stone is a fashion product that is killing the workers who make it. With alternatives readily available, why are we risking the lives of tradies for a fashionable finish in our kitchens?\"Caesarstone, a large engineered stone manufacturer, said it was \"deeply disappointed\" by the decision: “Most importantly, the decision fails to address the real cause of rising silicosis rates – poor compliance with and enforcement of safety standards.”" ,
    "source": "https://www.abc.net.au/news/2023-12-13/engineered-stone-ban-discussed-at-ministers-meeting/103224362"
  },
  {
    "headline": "NYT Is Saying ‘Nigger’ Less Than Ever",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a78468f1de2d12e3e0a13_IMG_0155%201.jpg",
    "image_name": "Blake, Wm. The Celebrated Graman Quacy., object 16. 1796.",
    "description": 
      "Matt Bruenig, the director of the People’s Policy Project think tank, has shared a graph that depicts The New York Times’ usage of “nigger” from 2000 to 2023.The findings are astonishing: in 2000, nearly 50 articles included the word, compared to just 4 in 2023.Bruenig said that if the trend continues, the NYT will officially hit nigger-zero by 2027.The paper of record hit its record “nigger” use in 2002, with over 50 articles including the sacred word."
    ,
    "source": "https://twitter.com/MattBruenig/status/1735097612670230902"
  },
  {
    "headline": "‘Antisemitism’ Shakedown Costs X $1.5B",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a6c87674a4d7e50374d8a_Blake%2C%20Wm.%20Jerusalem%20The%20Emanation%20of%20The%20Giant%20Albion%20%2C%20object%2041.%201821..jpg",
    "image_name": "Blake, Wm. Jerusalem The Emanation of The Giant Albion, object 41. 1821.",
    "description": 
      "Elon Musk’s X is facing the consequences of free speech, as Bloomberg reports the platform has already lost $1.5 billion from ad boycotts.The boycotts were spurred by claims that major corporations like Disney and Walmart were advertising next to “antisemitic” content.In response, Elon Musk filed a “thermonuclear” lawsuit against the company behind the claims: a progressive watchdog organization called Media Matters., X says Media Matters manipulated the platform to make it seem like these ads were placed next to the content when they never were.Musk has said his ultimate goal is to reduce reliance on advertising by moving to subscriptions, such as X Premium.For now, advertisers hold the power—creators are voicing concerns that the boycotts have hindered their ability to profit on the platform, to which Musk responded that there’s “not much we can do if advertisers boycott or reduce spend on our platform.”"
    ,
    "source": "https://arstechnica.com/tech-policy/2023/12/stop-comparing-xs-dismal-ad-sales-to-twitters-past-success-x-exec-says/"
  },
  {
    "headline": "Coach: 9/11 Was Excellent Teamwork",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a6c4e4b5f7aa83f095784_Blake%2C%20Wm.%20The%20Wrath%20of%20Elihu.%201805..jpg",
    "image_name": "Blake, Wm. The Wrath of Elihu. 1805.",
    "description": 
      "Buffalo Bills coach Sean McDermott has apologized after reports emerged that he cited the 9/11 terrorist attacks as an example of excellent teamwork during a speech to players.He pointed out that the 9/11 hijackers were all “on the same page” to orchestrate a terrorist attack to perfection.The comments were made during a team meeting 4 years ago but were not reported until now.McDermott asked the players with a straight face, “What tactics do you think they used to come together?” A young player tried to methodically answer. “What do you think their biggest obstacle was?” A veteran answered “TSA,” which lightened the mood.Speaking to reporters, McDermott apologized: “My intent in that meeting that day was to discuss the importance of communication and being on the same page with the team. I regretted mentioning 9/11 in my message that day, and I immediately apologized to the team.”He made sure to clarify that “not only was 9/11 a horrific event in our country’s history, but a day that I lost a good family friend.”",

    "source": "https://www.nbcnews.com/news/us-news/bills-coach-sean-mcdermott-apologizes-911-attackers-teamwork-speech-rcna128683"
  },
  {
    "headline": "News Channel Announces AI Anchors",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a6c330047bf74b4b67d64_Blake%2C%20Wm.%20The%20Three%20Maries%20at%20the%20Sepulchre.%201780..jpg",
    "image_name": "Blake, Wm. The Three Maries at the Sepulchre. 1780.",
    "description": 
      "An upcoming national news channel is replacing human anchors with hyper-realistic AI-generated avatars.Channel 1, set to launch next year, plans to use digitally generated people and digital doubles of real actors who had their bodies scanned.  Demonstration videos show anchors that talk, look, and move like real humans, but were designed on computers using AI technology. The channel plans to stream its news on TV apps and is set to add a translation feature to roll it out globally. Adam Mosam, the outlet's founder, told The Daily Mail that misuse of AI-generated news is inevitable, but Channel 1 aims to “get out in front of this and create a responsible use of the technology.” For the more important stories, actual human anchors will report from the scene, Mosam clarified. Additionally, for situations where original footage is unavailable, such as a news story about dinosaurs, AI-generated video will be shown onscreen and labeled as such.Mosam: “We believe that we can create a better news product to really better inform people.”"
    ,
    "source": "https://www.dailymail.co.uk/sciencetech/article-12859887/First-AI-generated-news-anchors-debut-streaming.html"
  },
  {
    "headline": "Poll: 1 in 3 Men Open to 2 Wives",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a6bd9050b7a84f02f1518_Blake%2C%20Wm.%20The%20Harlot%20and%20the%20Giant.%201824..jpeg",
    "image_name": "Blake, Wm. The Harlot and the Giant. 1824.",
    "description": 
      "A new survey in the UK found 33% of men are open to polygamous relationships, the practice of having more than one partner, despite them being outlawed.   Only 11% of women expressed the same openness.Additionally, 9% of men surveyed were willing to share a partner, while only 5% of women expressed interest.Polygamy is by no means new—historically, cultures all around the world practiced it, especially in Bronze Age families."
    ,
    "source": "https://studyfinds.org/men-wife-girlfriend-polygamy/"
  },
  {
    "headline": "U.S. Sees Nuclear Energy as Future",
    "image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/657a6bbaec98d48d254ab06d_Blake%2C%20Wm.%20Milton%27s%20Paradise%20Regained.%201816..jpg",
    "image_name": "Blake, Wm. Milton's Paradise Regained. 1816.",
    "description": 
      "For the first time in 50 years, the U.S. has permitted a new kind of nuclear reactor, signaling that regulators are open to exploring innovations in nuclear energy for the future.The reactor, engineered by California startup Kairos Power, uses molten fluoride salt as a coolant rather than water, which most reactors today use.Molten salts remain liquid at high temperatures and low pressure, providing a safety advantage over systems cooled by water.Kairos hopes to commercialize innovative designs that can be built in factories, enabling for a faster and cheaper process to expand nuclear energy.The ultimate goal is a commercial project that would use two large reactors and contain over 100 megawatts of capacity.CEO Mike Laufer: “We’re developing a technology that will be highly scalable. Affordability is really about being able to scale up.”"
    ,
    "source": "https://archive.is/gJDmX"
  }
]
