[
{
"headline": "SCOTUS Case May Undo Jan 6 Charges",
"image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/6578fc467919ade6bd7a7f72_Blake%2C%20Wm.%20When%20the%20Morning%20Stars%20Sang%20Together.%201805..jpg",
"image_name": "Blake, Wm. When the Morning Stars Sang Together. 1805.",
"description": "The Supreme Court announced it will hear an appeal that could reverse hundreds of charges from the events of January 6, 2021, including ones against Trump. The justices will review a case brought by Joseph Fischer, who has been charged with obstructing an official congressional proceeding on that day. Fischer says the crime he’s charged with is meant for people tampering with evidence, enacted as part of the Enron corruption scandal, and not for people who participated in a riot. A U.S. District Court agreed with Fischer and two other defendants charged with the same crime, saying they had to have taken some action involving evidence. Over 300 other defendants have been charged with this crime, and if the appeal goes through, their charges could also be reversed. Trump is also charged with conspiracy to obstruct an official proceeding, so the appeal’s ramifications could extend as far as him.",
"source": "https://www.usatoday.com/story/news/politics/2023/12/13/supreme-court-appeal-jan-6-trump-lang-fischer-miller/71846316007/"
},
{
"headline": "Puma Ends Israel Sponsorship",
"image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/6578993c211af2206ab29bef_Blake%2C%20Wm.%20Europe%20a%20Prophecy.%201804..jpg",
"image_name": "Blake, Wm. Europe a Prophecy. 1804.",
"description": "Puma will terminate its sponsorship of the Israeli national soccer team, pursuing a new strategy of “better” partnerships. According to Puma, the decision is based on commercial factors and participation in major tournaments, not because of the ongoing war. The company also emphasizes the move was determined at the end of 2022, yet the company technically has until 2024, when the contract in Israel expires. Thus, many on social media are seeing this as secretly being motivated by the outcry over Israel’s alleged war crimes in Gaza. Pro-Palestinian activists have celebrated the move as a victory for the Boycott, Divestment, and Sanctions (BDS) movement. BDS has long criticized Puma for sponsoring the Israel Football Association, alleging involvement in violations of international law.",
"source": "https://www.newsweek.com/puma-ending-israel-sponsorship-sparks-pro-palestinian-activist-celebration-1851635"
},
{
"headline": "College Graduates Can’t Find Jobs",
"image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/6579e8d6756cdb5223fb574e_Blake%2C%20Wm.%20For%20the%20Sexes-%20The%20Gates%20of%20Paradise%2C%20Object%206.%201793..jpg",
"image_name": "Blake, Wm. For the Sexes- The Gates of Paradise, Object 6. 1793.",

"description": "Bloomberg followed several students of the class of 2024, soon to graduate, who say they can’t find jobs in sectors like tech and finance. One student, Mikael Rahmani, a Boston University senior, is facing difficulties in finding a job in finance despite having good grades, internships, and extracurricular activities. Rahmani applies to about fifteen jobs per week but has yet to secure a job. Other seniors interviewed by Bloomberg reported similar results, saying their internship prospects in previous years don’t align with their bad luck in the job market. This trend comes as white-collar companies navigate an uncertain economy and higher-than-usual interest rates, spurring layoffs and reduced hiring. Career services at even the best universities say full-time recruitment is strangely quiet, and most interns are not receiving job offers. Kory Kantenga, an analyst at LinkedIn, noted that many of these graduates are finding it difficult to match a job with their skillset: “Are you going to end up as a barista with a bachelor’s degree?” This all comes as nearly half of all U.S. companies plan to eliminate Bachelor’s degree requirements, according to a November survey of 800 employers, including major corporations like Walmart and IBM. In other words: if you’re in college, you better graduate with a useful degree, or you’ll be competing with people who didn’t waste 50 racks a year to go to mid frat parties.",
"source":"https://archive.is/tgyFc"
},
{
"headline": "Tesla Recalls Almost All U.S. Cars",
"image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/6579e8fc08e2c41ea62b1008_Blake%2C%20Wm.%20Beatrice%20Addressing%20Dante%20from%20the%20Car.%201824..jpg",
"image_name": "Blake, Wm. Beatrice Addressing Dante from the Car. 1824.",
"description": "Tesla is recalling nearly all of its vehicles sold in the U.S. to address a software issue and a defective system in their Autopilot feature. The recall of more than two million follows a two-year government investigation into crashes involving Autopilot, some of which were fatal. New software updates will increase driver alerts and limit Autopilot's use in certain areas to make sure the driver is paying attention. The recall affects Tesla models Y, S, 3, and X made between 2012 and 2023. Tesla shares dropped over 3% after the recall announcement. Philip Koopman, professor at Carnegie Mellon University: “The compromise is disappointing because it does not fix the problem that the older cars do not have adequate hardware for driver monitoring.” Michael Brooks, executive director of the Center for Auto Safety: \"It’s not answering the question of why are Teslas on Autopilot not detecting and responding to emergency activity?\"",
"source":"https://apnews.com/article/tesla-autopilot-recall-driver-monitoring-system-8060508627a34e6af889feca46eb3002"
},
{
"headline": "‘Vultures’ Is Available for Pre-Order",
"image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/6579eb685e69152ea9cad915_IMG_0587.jpg",
"image_name": "",
"description": "Ye and Ty Dolla $ign’s “Vultures” album is now available for pre-order on streaming platforms, with a release date of Friday, December 15. Eighteen tracks comprise the album, with the titular track “Vultures,” featuring Bump J and Lil Durk, already available for listening.",
"source":"https://le.ffm.to/vultures1"
},
{
"headline": "Luxury Brands Embrace Banality",
"image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/6579e93864f16bd0b6804a87_Blake%2C%20Wm.%20Joseph%20of%20Arimathea%20Among%20the%20Rocks%20of%20Albion.%201773..jpg",
"image_name": "Blake, Wm. Joseph of Arimathea Among the Rocks of Albion. 1773.",
"description": "Brands like Bottega Veneta, Gucci, and Louis Vuitton are embracing mundane, everyday moments in their latest campaigns, a departure from the elegance and glamor that typically characterize the campaigns. In Bottega Veneta’s Pre-Spring 2024 campaign called “Readymade,” A$AP Rocky and Kendall Jenner are pictured carrying groceries, pumping gas, drinking coffee, and jogging. As noted by The Business of Fashion, the pictures weren’t produced by a fashion photographer but by paparazzi, who first published the pictures in TMZ. In September, Gucci also released paparazzi-style images featuring Bad Bunny and Kendall Jenner in the airport with Gucci luggage. And in Pharrell’s first Louis Vuitton campaign, Rihanna carried a coffee cup while wearing a Speedy bag, almost like she was running an errand. Riccardo Zanola, the art director behind several of Gucci’s latest campaigns: “People want to be related to. We’ve been dreaming too much about other places, other spaces, other worlds.”",
"source":"https://1ft.io/proxy?q=https%3A%2F%2Fwww.businessoffashion.com%2Farticles%2Fmarketing-pr%2Fwhy-banal-is-big-in-fashions-latest-campaigns%2F"
},
{
"headline": "Draymond Green Smacks Jusuf Nurkić",
"image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/6579e95e4e16942065fbce3d_Blake%2C%20Wm.%20The%20Stygian%20Lake%20with%20the%20Ireful%20Sinners%20Fighting.%201824..jpg",
"image_name": "Blake, Wm. The Stygian Lake with the Ireful Sinners Fighting. 1824.",
"description": "Draymond Green was ejected from a game against the Phoenix Suns last night after he took a swing at Jusuf Nurkić. This situation came in the third quarter, as Green and Nurkić competed for position on an in-bounds play. For seemingly no reason, Green then spun around and slapped Nurkić across the face. This comes just two weeks after Green returned from a five-game for putting Rudy Gobert in a chokehold. Reactions on social media varied, with some finding it offensive and others finding it ridiculously hilarious. One user on X: “nigga got a better wwe mixtape than hoops.”",
"source":"https://twitter.com/big_business_/status/1734795892161409067"
},
{
"headline": "Israel Soldiers Destroy Private Homes",
"image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/6579e97f062d7fe1cac2e114_Blake%2C%20Wm.%20The%20Sculls%20of%20Lieu.t.%20Leppar%2C%20%26%20Six%20of%20his%20Men.%201796..jpg",
"image_name": "Blake, Wm. The Sculls of Lieut. Leppar, & Six of his Men. 1796.",
"description": "Viral videos and photos have circulated of Israeli soldiers in Gaza destroying toys, burning food and water supplies, and moving Muslim prayer rugs into a bathroom. These actions are often uploaded by the soldiers themselves and have raised international concerns. The Israeli military blames Hamas for the civilian casualties, citing their tactics of operating in crowded neighborhoods and using human shields. A video posted by Israeli media personality Yinon Magal on X reveals soldiers dancing in a circle in Gaza, singing a song that includes the words, “Gaza we have come to conquer. ... We know our slogan – there are no people who are uninvolved.” Yinon Magal: “These are my fighters, they’re fighting against brutal murderers, and after what they did to us, I don’t have to defend myself from anyone.” Dror Sadot, spokeswoman for the Israeli human rights group B'Tselem: “The dehumanization from the top is very much sinking down to the soldiers.”",
"source":"https://apnews.com/article/israel-hamas-soldiers-gaza-viral-videos-idf-072894147302535cc9632863888e53a4"
},
{
"headline": "Poll: 74% Of U.S. Fooled by Deepfakes",
"image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/6579ea220e4be32d97752dc3_Blake%2C%20Wm.%20The%20Book%20of%20Los%2C%20object%201.%201795..jpg",
"image_name": "Blake, Wm. The Book of Los, object 1. 1795.",
"description": "A new survey of 2,000 U.S. adults finds that 74% can no longer tell what’s real or fake on the Internet due to the rapid progress of AI. As a result, adults assume only 37% of the content they see online is “real,” meaning free of AI, photoshop, and editing. 71% of Americans believe that over the next decade, it will be increasingly challenging to determine what’s real or not.",
"source":"https://studyfinds.org/deepfake-americans-real-or-fake/"
},
{
"headline": "Ancient Roman Baths Found in Croatia",
"image_source": "https://assets-global.website-files.com/6500bdee3b9e070412a101f7/6579ea495ce78c2e501475ea_Blake%2C%20Wm.%20Jerusalem%20The%20Emanation%20of%20The%20Giant%20Albion%2C%20Object%201.%201801..jpg",
"image_name": "Blake, Wm. Jerusalem The Emanation of The Giant Albion, Object 1. 1801.",
"description": "Archaeologists trying to install an elevator in a Croatian museum were caught off-guard when they uncovered Roman baths under the museum. Amazingly, the baths are in well-preserved condition and include a pool, mosaic floors, ancient underfloor heating, an oil and grape press, and a furnace. During the Roman Empire, communal bathing was common, acting as a space for socializing and relaxation. These baths are believed to be part of Diocletian’s Palace, built at the end of the third century for the Roman emperor’s retirement.",
"source":"https://news.artnet.com/art-world/roman-baths-split-croatia-2406697"
}
]